tutorials/CFD/20CompressibleForwardStep/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 4;
NmodesUproj 3;
NmodesUtest 1;
NnonlinearModes 4;
NDEIM 50;

bcMethod penalty;
timedepbcMethod no;
timeDerivativeSchemeOrder first;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
